---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.ExternalServiceId
source: html/af186745-fdde-2bcb-35d6-a6dc645450a6.htm
---
# ExternalServiceId Members

Creates a new ExternalServiceId instance.